{"data":{"site":{"siteMetadata":{"title":"Bee starter","author":"[Your Name]","siteUrl":"https://gatsby-starter-bee.netlify.com","comment":{"disqusShortName":"","utterances":"JaeYeopHan/gatsby-starter-bee"},"sponsor":{"buyMeACoffeeId":"jbee"}}},"markdownRemark":{"id":"ed058d65-9eaa-5c12-99f2-29ee8a31203e","excerpt":"    找工作的事情总算是告一段落，在资本寒冬来临的时候，自己也是十分好运的搭上了互联网的末班车，比起身边其他人，我找工作的过程也没有多艰辛，暑期的时候同学内推了现在的公司，然后视频面试，两轮技术面，一轮hr面，9月初的时候拿到了意向offer，9月底的时候拿到了正式的聘用书，拿到意向offer后基本上就没跑过招聘会，但是等到…","html":"<p>  找工作的事情总算是告一段落，在资本寒冬来临的时候，自己也是十分好运的搭上了互联网的末班车，比起身边其他人，我找工作的过程也没有多艰辛，暑期的时候同学内推了现在的公司，然后视频面试，两轮技术面，一轮hr面，9月初的时候拿到了意向offer，9月底的时候拿到了正式的聘用书，拿到意向offer后基本上就没跑过招聘会，但是等到9月底的时候实在是等到崩溃了，在学校笔试了几个公司，去西电笔试了一场，基本上都拿到面试机会了，奇怪的是笔试我觉得我答的可以的没有过，笔试答的不好的，反而拿到面试，始终搞不明白改卷子的人的评判标准，找工作时候如果招聘会有现场笔试尽量参加，现场笔试往往当天晚上或者第二天就出结果，网上笔试我觉得是最难的，我网测反正是没有一家笔过了的，不论我感觉做的好或者不好，最好找熟人内推，当然对于某些发内推码做宣传的公司，还有内推还有笔试的公司我实在是被恶心到了。（仅代表个人意见，巨巨请随意）。</p>\n<p>  也有一些同学问我找工作的经验，其实真的很难和这些人说，我写程序写了三年了，你学了一个月两个月，我很难给出建议，校招和社招毕竟不一样，校招注重的是基础，社招注重的是经验，身边很多人去上了个培训班，写了个网站，写了个App以为就够了，面试笔试的时候不会问你API，你写个网站我问你TCP的一些基本知识，TCP为了实现可靠协议做了那些工作都说不出来，我很难让你这轮面试过；你写App我问进程和线程的关系你答不出来，问你进程间通信的方式你一摊手说不会，说没教过。我觉得这些人根本不适合干这一行，如果是一开始是为了薪资待遇来干这一行的人请你先做好加班和终身学习的准备，钱从来都不是那么好挣的。</p>\n<p><img src=\"http://octh00z8u.bkt.clouddn.com/IMG_0019.JPG\" alt=\"image\"></p>\n<p>  上面这段文字是我2016年1月1号跨年的时候写的，现在回头去看我的2015年，身边的人来来往往，有离开的，有留下的，无论你们给我留下的回忆是痛苦或者开心，谢谢你们。要说这半年我有什么变化，最大的变化是总算是遇上了那个我觉得对的人，遇上了自己想拼尽全力对她好的那个人，还有就是心态上变得比以前更平和一些，但是感觉为人处事还是不够成熟，虽然很多人我都不care，我经常给娜娜说，有些人我真的不是很想交流，不是性格处不来，是真的段位差别大，很难交流，我好好给你说话，你说装逼，话说的重一点，你说我在嘲讽你，我不知道这些人是哪里来的玻璃心，现在的我倒是好多了，我没必要去关心别人的的生活和未来，我过的始终是我的生活。</p>\n<p>  偶然的一个机会知道了学校的一个很牛逼的学长，现在在twitter，做Linux内核开发，给Linux内核打了三百多个补丁，真的是强到爆炸，看了他博客里面一些文章（技术文章讲kernel的，大多看不懂，看了一些碎碎念），特别是这篇<a href=\"http://wangcong.org/2014/01/30/-e6-88-91-e7-9a-842013-ef-bc-9a-e6-88-91-e6-9d-a5-e5-88-b0-e4-ba-86-e7-be-8e-e5-9b-bd/\">我的2013：我来到了美国</a>，这位学长是08年毕业的，毕业之后去葡萄牙工作了一段时间，然后回北京红帽工作了一段时间，在北京红帽工作的时候在大理远程办公了一段时间，然后带着妹子肉身翻了墙，看学长twitter上的tweet，养了只柯基，在加州的日子很爽，上面提到的那篇博客里面我很认同一点的是我自己的事情，为什么要受到父母亲戚朋友的束缚，孝顺固然重要，但是我要过我自己的人生，过的好或者坏，我自己能够承担，暑假的时候身边有同学在准备出国，他是西安本地人，以前的他是准备学点Java在西安找个工作，后面学校有一个去美国交流的项目，去了两个月回来之后，感觉他彻底变了一个人，努力的学习英语，考雅思，说想去更大的世界看看，很多人说国外未必有国内好，但是你问这批人，到底哪里不好，哪里好，他多半说不出来，因为这些人多半没有出去过，没有一个国家是完美的，包括美国也不是尽善尽美的，但是如果有个国家吹着自由的风，我相信那肯定不是中国，不仅仅是那座让google、facebook进不来的墙，更多的是国人心中那道墙，也许有那么一天，当打开google的时候不再是404，当人们心中那道墙倒塌的时候，也许我们可以闻到自由的味道。</p>\n<p>  “打柴的和放羊的遇见了，两个人在一起闲聊，到了下午太阳落山了，人家的羊吃完草，高高兴兴回家了，你的柴开始砍了吗？”为什么同样是一个学校，一个专业，一个班级出来的人最后千差万别，都是成年人，自己要学会对自己干的事负责，别退缩，别回避，说句俗的话，自己的锅自己背，自己的粪自己掏。不要最后只看到了别人的结果，没有看到别人的努力，如果现在手上还有把刀，请好好砍你的柴，最害怕的是那些连刀都丢了的人。</p>\n<p>  再过几个月就要离开学校步入社会，告别学生生涯了，以后的生活，我想去看看更大的世界，我想带着我心爱的那个她一起走过山川大河，希望到时候的我不会惶恐和害怕，也愿路途不再往复，愿无岁月可回头。</p>\n<hr>\n<p><strong><em>兴趣遍地都是，坚持和持之以恒才是稀缺的</em></strong></p>","frontmatter":{"title":"愿路途不再往复","date":"October 02, 2016"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2016-10-02-愿路途不再往复，愿无岁月可回头/","previous":null,"next":{"fields":{"slug":"/2018-1-05-MyYearOf2018/"},"frontmatter":{"title":"My Year Of 2018","category":"Life"}}}}